XSD/dsfrd.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions 
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
        xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" 
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
        xmlns:msg="http://www.broservices.nl/xsd/dsfrd/1.0" 
        xmlns:tns="http://www.broservices.nl/wsdl/dsfrd/1.0" 
        name="dsfrd" 
        targetNamespace="http://www.broservices.nl/wsdl/dsfrd/1.0">
    <wsdl:documentation>
        This  WSDL defines the webservice for the FRD intake webservice (GroundwaterLevelDossier)
        in the context of the baseregistry subsurface (Basisregistratie Ondergrond).
        This is version 0.1.0
        Changes compared to Version:0.1.0:
        - 
    </wsdl:documentation>
    <wsdl:types>
        <xsd:schema xmlns:tns="http://www.broservices.nl/wsdl/dsfrd/1.0" targetNamespace="http://www.broservices.nl/wsdl/dsfrd/1.0">
            <!--
            <xsd:import namespace="http://www.broservices.nl/xsd/dsfrd/1.0" schemaLocation="https://schema.broservices.nl/xsd/dsfrd/1.0/dsfrd-messages.xsd"/>
            -->
            <xsd:import namespace="http://www.broservices.nl/xsd/dsfrd/1.0" schemaLocation="dsfrd-messages.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="dispatchDataRequest">
        <wsdl:part name="request" element="msg:dispatchDataRequest"/>
    </wsdl:message>
    <wsdl:message name="dispatchDataResponse">
        <wsdl:part name="response" element="msg:dispatchDataResponse"/>
    </wsdl:message>
    <wsdl:message name="parseSoapFault">
        <wsdl:part name="parseFault" element="msg:parseFault"/>
    </wsdl:message>
    <wsdl:portType name="dsfrd">
        <wsdl:operation name="dispatchData">
            <wsdl:input message="tns:dispatchDataRequest" wsam:Action="http://www.broservices.nl/wus/dsfrd/dispatchDataRequest"/>
            <wsdl:output message="tns:dispatchDataResponse" wsam:Action="http://www.broservices.nl/wus/dsfrd/dispatchDataResponse"/>
            <wsdl:fault name="parsefault" message="tns:parseSoapFault" wsam:Action="http://www.broservices.nl/wus/dsfrd/parseSoapFault"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="dsfrd_SOAP" type="tns:dsfrd">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="dispatchData">
            <soap:operation soapAction="" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="parsefault">
                <soap:fault name="parsefault" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="dsfrd">
        <wsdl:port name="dsfrd_SOAP" binding="tns:dsfrd_SOAP">
            <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
